Revit 2024 API
ExternallyTaggedNonBRepUsage Enumeration
 The ways in which an ExternallyTaggedNonBRep can be used in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum ExternallyTaggedNonBRepUsage
Visual Basic
Public Enumeration ExternallyTaggedNonBRepUsage
Visual C++
public enum class ExternallyTaggedNonBRepUsage
Members
Member name | Description
Displayable |  Can be used for display purposes.
Selectable |  Can be selected as well as displayed.
Snappable |  Can be snapped to as well as selected.
Referenceable |  Can be dimensioned to as well as snapped to.
See Also
Autodesk.Revit.DB Namespace